#calculator
print("----------------------------------------------")
while(1):
    a=int(input("INPUT NUM1: "))
    ch=input("연산자를 입력해주세요: ")
    b=int(input("INPUT NUM2: "))
    print("===============================================")

    if ch=="+":
        print("더하기 연산")
        print("%d + %d = %d"%(a,b,a+b))
        print("===============================================")
    elif ch=="-":
        print("빼기 연산")
        print("%d - %d = %d"%(a,b,a-b))
        print("===============================================")
    elif ch=="*":
        print("곱하기 연산")
        print("%d * %d = %d"%(a,b,a*b))
        print("===============================================")
    elif ch=="/":
        print("나누기 연산")
        print("%d / %d = %f"%(a,b,a/b))
        print("===============================================")
    elif ch=="%":
        print("나머지 연산")
        print("%d %% %d = %d"%(a,b,a%b))
        print("===============================================")
    elif ch=="//":
        print("나머지 몫 연산")
        print("%d // %d = %d"%(a,b,a//b))
        print("===============================================")
    elif ch=="**":
        print("거듭제곱 연산")
        print("%d ** %d = %d"%(a,b,a**b))
        print("===============================================")
    else:
        print("연산자 오류로 인한 종료")
        print("===============================================")
        break
